In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split

from feature_engine import categorical_encoders as ce

# OneHotCategoricalEncoder

In [12]:
data = pd.read_csv('phpMYEkMl.csv')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1309 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: int64(4), object(10)
memory usage: 143.3+ KB

In [15]:
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"

In [4]:
data.cabin

0            B5
1       C22 C26
2       C22 C26
3       C22 C26
4       C22 C26
         ...
1304          ?
1305          ?
1306          ?
1307          ?
1308          ?
Name: cabin, Length: 1309, dtype: object

In [5]:
data['cabin'].astype(str).str[0]

0       B
1       C
2       C
3       C
4       C
       ..
1304    ?
1305    ?
1306    ?
1307    ?
1308    ?
Name: cabin, Length: 1309, dtype: object

In [6]:
data['pclass']

0       1
1       1
2       1
3       1
4       1
       ..
1304    3
1305    3
1306    3
1307    3
1308    3
Name: pclass, Length: 1309, dtype: int64

In [7]:
data['pclass'].astype('O')

0       1
1       1
2       1
3       1
4       1
       ..
1304    3
1305    3
1306    3
1307    3
1308    3
Name: pclass, Length: 1309, dtype: object

In [14]:
data['embarked'].isnull().sum()

0

In [10]:
data['embarked'].fillna('C', inplace=True)

In [13]:
data['embarked']

0       S
1       S
2       S
3       S
4       S
       ..
1304    C
1305    C
1306    C
1307    C
1308    S
Name: embarked, Length: 1309, dtype: object

In [16]:
# Load dataset
def load_titanic():
        data = pd.read_csv('phpMYEkMl.csv')
        data = data.replace('?', np.nan)
        data['cabin'] = data['cabin'].astype(str).str[0]
        data['pclass'] = data['pclass'].astype('O')
        data['embarked'].fillna('C', inplace=True)
        return data

data = load_titanic()

# Separate into train and test sets
X_train, X_test, y_train, y_test = train_test_split(
                        data.drop(['survived', 'name', 'ticket'], axis=1),
                        data['survived'], test_size=0.3, random_state=0)

In [17]:
# set up the encoder
encoder = ce.OneHotCategoricalEncoder(
    top_categories=2,
    variables=['pclass', 'cabin', 'embarked'],
    drop_last=False)

In [19]:
# fit the encoder
encoder.fit(X_train)

# transform the data
train_t= encoder.transform(X_train)
test_t= encoder.transform(X_test)

In [20]:
encoder.encoder_dict_

{'pclass': [3, 1], 'cabin': ['n', 'C'], 'embarked': ['S', 'C']}

In [23]:
X_train['pclass'].value_counts()

3    498
1    230
2    188
Name: pclass, dtype: int64

In [24]:
X_train['cabin'].value_counts()

n    702
C     71
B     42
E     32
D     32
A     17
F     15
G      4
T      1
Name: cabin, dtype: int64

In [25]:
X_train['embarked'].value_counts()

S    652
C    181
Q     83
Name: embarked, dtype: int64

In [26]:
train_t # we can see new columns, pclass_3, pclass_1, cabin_n, cabin_C, embarked_S, embarked_C

,sex,age,sibsp,parch,fare,boat,body,home.dest,pclass_3,pclass_1,cabin_n,cabin_C,embarked_S,embarked_C
501,female,13,0,1,19.5,14,NaN,"England / Bennington, VT",0,0,1,0,1,0
588,female,4,1,1,23,14,NaN,"Cornwall / Akron, OH",0,0,1,0,1,0
402,female,30,1,0,13.8583,12,NaN,"Barcelona, Spain / Havana, Cuba",0,0,1,0,0,1
1193,male,NaN,0,0,7.725,NaN,NaN,NaN,1,0,1,0,0,0
686,female,22,0,0,7.725,13,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls...",1,0,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
763,female,0.1667,1,2,20.575,10,NaN,"Devon, England Wichita, KS",1,0,1,0,1,0
835,male,NaN,0,0,8.05,NaN,NaN,NaN,1,0,1,0,1,0
1216,female,NaN,0,0,7.7333,13,NaN,NaN,1,0,1,0,0,0
559,female,20,0,0,36.75,11,NaN,"Cornwall / Hancock, MI",0,0,1,0,1,0
684,female,32,1,1,15.5,NaN,NaN,"Ireland Chicago, IL",1,0,1,0,0,0

# CountFrequencyCategoricalEncoder

In [4]:
# Load dataset. Able to load from webiste. 
def load_titanic():
        data = pd.read_csv('https://www.openml.org/data/get_csv/16826755/phpMYEkMl')
        data = data.replace('?', np.nan)
        data['cabin'] = data['cabin'].astype(str).str[0]
        data['pclass'] = data['pclass'].astype('O')
        data['embarked'].fillna('C', inplace=True)
        return data

data = load_titanic()

# Separate into train and test sets
X_train, X_test, y_train, y_test = train_test_split(
                data.drop(['survived', 'name', 'ticket'], axis=1),
                data['survived'], test_size=0.3, random_state=0)

# set up the encoder
encoder = ce.CountFrequencyCategoricalEncoder(encoding_method='frequency',
                         variables=['cabin', 'pclass', 'embarked'])

# fit the encoder
encoder.fit(X_train)

# transform the data
train_t= encoder.transform(X_train)
test_t= encoder.transform(X_test)

encoder.encoder_dict_

{'cabin': {'n': 0.7663755458515283,
  'C': 0.07751091703056769,
  'B': 0.04585152838427948,
  'D': 0.034934497816593885,
  'E': 0.034934497816593885,
  'A': 0.018558951965065504,
  'F': 0.016375545851528384,
  'G': 0.004366812227074236,
  'T': 0.001091703056768559},
 'pclass': {3: 0.5436681222707423,
  1: 0.25109170305676853,
  2: 0.2052401746724891},
 'embarked': {'S': 0.7117903930131004,
  'C': 0.19759825327510916,
  'Q': 0.0906113537117904}}

In [6]:
X_train['cabin'].value_counts()

n    702
C     71
B     42
D     32
E     32
A     17
F     15
G      4
T      1
Name: cabin, dtype: int64

In [8]:
X_train['pclass'].value_counts()

3    498
1    230
2    188
Name: pclass, dtype: int64

In [9]:
train_t.head() # we can see that pclass, cabin, embarked column values are replaced with percentages.

,pclass,sex,age,sibsp,parch,fare,cabin,embarked,boat,body,home.dest
501,0.205240,female,13,0,1,19.5,0.766376,0.711790,14,NaN,"England / Bennington, VT"
588,0.205240,female,4,1,1,23,0.766376,0.711790,14,NaN,"Cornwall / Akron, OH"
402,0.205240,female,30,1,0,13.8583,0.766376,0.197598,12,NaN,"Barcelona, Spain / Havana, Cuba"
1193,0.543668,male,NaN,0,0,7.725,0.766376,0.090611,NaN,NaN,NaN
686,0.543668,female,22,0,0,7.725,0.766376,0.090611,13,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls..."

In [10]:
# Instead of Percentage we can use count also. Dependening on the requirement and what makes sense we need to 
# use accordingly.

# Load dataset
def load_titanic():
        data = pd.read_csv('https://www.openml.org/data/get_csv/16826755/phpMYEkMl')
        data = data.replace('?', np.nan)
        data['cabin'] = data['cabin'].astype(str).str[0]
        data['pclass'] = data['pclass'].astype('O')
        data['embarked'].fillna('C', inplace=True)
        return data

data = load_titanic()

# Separate into train and test sets
X_train, X_test, y_train, y_test = train_test_split(
                data.drop(['survived', 'name', 'ticket'], axis=1),
                data['survived'], test_size=0.3, random_state=0)

# set up the encoder
encoder = ce.CountFrequencyCategoricalEncoder(encoding_method='count',   # change to count here. 
                         variables=['cabin', 'pclass', 'embarked'])

# fit the encoder
encoder.fit(X_train)

# transform the data
train_t= encoder.transform(X_train)
test_t= encoder.transform(X_test)

encoder.encoder_dict_

{'cabin': {'n': 702,
  'C': 71,
  'B': 42,
  'D': 32,
  'E': 32,
  'A': 17,
  'F': 15,
  'G': 4,
  'T': 1},
 'pclass': {3: 498, 1: 230, 2: 188},
 'embarked': {'S': 652, 'C': 181, 'Q': 83}}

In [11]:
train_t.head()

,pclass,sex,age,sibsp,parch,fare,cabin,embarked,boat,body,home.dest
501,188,female,13,0,1,19.5,702,652,14,NaN,"England / Bennington, VT"
588,188,female,4,1,1,23,702,652,14,NaN,"Cornwall / Akron, OH"
402,188,female,30,1,0,13.8583,702,181,12,NaN,"Barcelona, Spain / Havana, Cuba"
1193,498,male,NaN,0,0,7.725,702,83,NaN,NaN,NaN
686,498,female,22,0,0,7.725,702,83,13,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls..."

In [14]:
# we can reverse the setting also using INVERSE TRANSFORM funtion/parameter. 

train_t = encoder.inverse_transform(train_t)
train_t.head()

,pclass,sex,age,sibsp,parch,fare,cabin,embarked,boat,body,home.dest
501,2,female,13,0,1,19.5,n,S,14,NaN,"England / Bennington, VT"
588,2,female,4,1,1,23,n,S,14,NaN,"Cornwall / Akron, OH"
402,2,female,30,1,0,13.8583,n,C,12,NaN,"Barcelona, Spain / Havana, Cuba"
1193,3,male,NaN,0,0,7.725,n,Q,NaN,NaN,NaN
686,3,female,22,0,0,7.725,n,Q,13,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls..."

# OrdinalCategoricalEncoder

In [15]:
# Load dataset
def load_titanic():
        data = pd.read_csv('https://www.openml.org/data/get_csv/16826755/phpMYEkMl')
        data = data.replace('?', np.nan)
        data['cabin'] = data['cabin'].astype(str).str[0]
        data['pclass'] = data['pclass'].astype('O')
        data['embarked'].fillna('C', inplace=True)
        return data

data = load_titanic()

# Separate into train and test sets
X_train, X_test, y_train, y_test = train_test_split(
                data.drop(['survived', 'name', 'ticket'], axis=1),
                data['survived'], test_size=0.3, random_state=0)

# set up the encoder
encoder = ce.OrdinalCategoricalEncoder(encoding_method='ordered',
                                                 variables=['pclass', 'cabin', 'embarked'])

# fit the encoder
encoder.fit(X_train, y_train)

# transform the data
train_t= encoder.transform(X_train)
test_t= encoder.transform(X_test)

encoder.encoder_dict_

{'pclass': {3: 0, 2: 1, 1: 2},
 'cabin': {'T': 0,
  'n': 1,
  'G': 2,
  'A': 3,
  'C': 4,
  'F': 5,
  'D': 6,
  'E': 7,
  'B': 8},
 'embarked': {'S': 0, 'Q': 1, 'C': 2}}

In [16]:
X_train['cabin'].value_counts()

n    702
C     71
B     42
D     32
E     32
A     17
F     15
G      4
T      1
Name: cabin, dtype: int64

In [43]:
df1 = data.groupby(['cabin'])[['survived']].mean()

In [44]:
df1.sort_values(['survived'],ascending=False)

       survived
cabin
E      0.731707
B      0.723077
D      0.695652
F      0.619048
C      0.606383
G      0.600000
A      0.500000
n      0.302761
T      0.000000

In [49]:
encoder.encoder_dict_  

#looks like it has tried to give in reverse order by still some not in sync. may be because program got diff mean

{'pclass': {3: 0, 2: 1, 1: 2},
 'cabin': {'T': 0,
  'n': 1,
  'G': 2,
  'A': 3,
  'C': 4,
  'F': 5,
  'D': 6,
  'E': 7,
  'B': 8},
 'embarked': {'S': 0, 'Q': 1, 'C': 2}}

In [45]:
df2 = data.groupby(['pclass'])[['survived']].mean()

In [46]:
df2.sort_values(['survived'],ascending=False)

        survived
pclass
1       0.619195
2       0.429603
3       0.255289

In [50]:
encoder.encoder_dict_  #for pclass order is given as per target mean value

{'pclass': {3: 0, 2: 1, 1: 2},
 'cabin': {'T': 0,
  'n': 1,
  'G': 2,
  'A': 3,
  'C': 4,
  'F': 5,
  'D': 6,
  'E': 7,
  'B': 8},
 'embarked': {'S': 0, 'Q': 1, 'C': 2}}

In [47]:
df3 = data.groupby(['embarked'])[['survived']].mean()

In [48]:
df3.sort_values(['survived'],ascending=False)

          survived
embarked
C         0.558824
Q         0.357724
S         0.332604

In [51]:
encoder.encoder_dict_  #for embarked, order is given as per target mean value

{'pclass': {3: 0, 2: 1, 1: 2},
 'cabin': {'T': 0,
  'n': 1,
  'G': 2,
  'A': 3,
  'C': 4,
  'F': 5,
  'D': 6,
  'E': 7,
  'B': 8},
 'embarked': {'S': 0, 'Q': 1, 'C': 2}}

In [52]:
# INVERSE TRANSFORM funtion is availalble for OrdinalCategoricalEncoder also.

# MeanCategoricalEncoder

In [53]:
# Load dataset
def load_titanic():
        data = pd.read_csv('https://www.openml.org/data/get_csv/16826755/phpMYEkMl')
        data = data.replace('?', np.nan)
        data['cabin'] = data['cabin'].astype(str).str[0]
        data['pclass'] = data['pclass'].astype('O')
        data['embarked'].fillna('C', inplace=True)
        return data

data = load_titanic()

# Separate into train and test sets
X_train, X_test, y_train, y_test = train_test_split(
                data.drop(['survived', 'name', 'ticket'], axis=1),
                data['survived'], test_size=0.3, random_state=0)

# set up the encoder
encoder = ce.MeanCategoricalEncoder(variables=['cabin', 'pclass', 'embarked'])

# fit the encoder
encoder.fit(X_train, y_train)

# transform the data
train_t= encoder.transform(X_train)
test_t= encoder.transform(X_test)

encoder.encoder_dict_

{'cabin': {'A': 0.5294117647058824,
  'B': 0.7619047619047619,
  'C': 0.5633802816901409,
  'D': 0.71875,
  'E': 0.71875,
  'F': 0.6666666666666666,
  'G': 0.5,
  'T': 0.0,
  'n': 0.30484330484330485},
 'pclass': {1: 0.6173913043478261,
  2: 0.43617021276595747,
  3: 0.25903614457831325},
 'embarked': {'C': 0.5580110497237569,
  'Q': 0.37349397590361444,
  'S': 0.3389570552147239}}

In [54]:
df1 = data.groupby(['cabin'])[['survived']].mean()
df1  
# our mean is not matching with the above mean calculated by algorithm. This is the reason even in OrdinalCategorical
#Encoder the order of value was not in sync. But not sure why we getting diff mean than algorithm.

       survived
cabin
A      0.500000
B      0.723077
C      0.606383
D      0.695652
E      0.731707
F      0.619048
G      0.600000
T      0.000000
n      0.302761

In [55]:
# INVERSE TRANSFORM funtion is available for this FE technique also.

# RareLabelCategoricalEncoder

In [56]:
def load_titanic():
    data = pd.read_csv(
        'https://www.openml.org/data/get_csv/16826755/phpMYEkMl')
    data = data.replace('?', np.nan)
    data['cabin'] = data['cabin'].astype(str).str[0]
    data['pclass'] = data['pclass'].astype('O')
    data['embarked'].fillna('C', inplace=True)
    return data

data = load_titanic()

# Separate into train and test sets
X_train, X_test, y_train, y_test = train_test_split(
    data.drop(['survived', 'name', 'ticket'], axis=1),
    data['survived'], test_size=0.3, random_state=0)

# set up the encoder
encoder = ce.RareLabelCategoricalEncoder(tol=0.03, n_categories=2,
                                         variables=['cabin', 'pclass', 'embarked'],
                                         replace_with='Rare')

# fit the encoder
encoder.fit(X_train)

# transform the data
train_t = encoder.transform(X_train)
test_t = encoder.transform(X_test)

encoder.encoder_dict_

{'cabin': Index(['n', 'C', 'B', 'D', 'E'], dtype='object'),
 'pclass': Int64Index([3, 1, 2], dtype='int64'),
 'embarked': Index(['S', 'C', 'Q'], dtype='object')}

In [57]:
data['cabin'].value_counts() # For A => 22/1309 = 0.01 hence grouped under rare.

n    1014
C      94
B      65
D      46
E      41
A      22
F      21
G       5
T       1
Name: cabin, dtype: int64

In [58]:
data.shape

(1309, 14)

In [ ]:
# You can also specify the maximum number of categories that can be considered frequent using the 
# max_n_categories parameter.

In [96]:
data = {'var_A': ['A'] * 10 + ['B'] * 10 + ['C'] * 2 + ['D'] * 1}
data = pd.DataFrame(data)
data['var_A'].value_counts()

A    10
B    10
C     2
D     1
Name: var_A, dtype: int64

In [121]:
rare_encoder = ce.RareLabelCategoricalEncoder(tol=0.05, n_categories=3, max_n_categories=2)

In [122]:
df1 = rare_encoder.fit_transform(data)

In [124]:
df1['var_A'].value_counts()

A       10
B       10
Rare     3
Name: var_A, dtype: int64

# WoERatioCategoricalEncoder (only works for binary classification)

In [125]:
# Load dataset
def load_titanic():
        data = pd.read_csv('https://www.openml.org/data/get_csv/16826755/phpMYEkMl')
        data = data.replace('?', np.nan)
        data['cabin'] = data['cabin'].astype(str).str[0]
        data['pclass'] = data['pclass'].astype('O')
        data['embarked'].fillna('C', inplace=True)
        return data

data = load_titanic()

# Separate into train and test sets
X_train, X_test, y_train, y_test = train_test_split(
                data.drop(['survived', 'name', 'ticket'], axis=1),
                data['survived'], test_size=0.3, random_state=0)


# set up a weight of evidence encoder
woe_encoder = ce.WoERatioCategoricalEncoder(
encoding_method='woe', variables=['cabin', 'pclass', 'embarked'])

# fit the encoder
woe_encoder.fit(train_t, y_train)

# transform
train_t = woe_encoder.transform(train_t)
test_t = woe_encoder.transform(test_t)

woe_encoder.encoder_dict_

{'cabin': {'B': 1.6299623810120747,
  'C': 0.7217038208351837,
  'D': 1.405081209799324,
  'E': 1.405081209799324,
  'Rare': 0.7387452866900354,
  'n': -0.35752781962490193},
 'pclass': {1: 0.9453018143294478,
  2: 0.21009172435857942,
  3: -0.5841726684724614},
 'embarked': {'C': 0.6999054533737715,
  'Q': -0.05044494288988759,
  'S': -0.20113381737960143}}

# DecisionTreeCategoricalEncoder

In [126]:
# Load dataset
def load_titanic():
        data = pd.read_csv('https://www.openml.org/data/get_csv/16826755/phpMYEkMl')
        data = data.replace('?', np.nan)
        data['cabin'] = data['cabin'].astype(str).str[0]
        data['pclass'] = data['pclass'].astype('O')
        data['embarked'].fillna('C', inplace=True)
        return data

data = load_titanic()

# Separate into train and test sets
X_train, X_test, y_train, y_test = train_test_split(
                data.drop(['survived', 'name', 'ticket'], axis=1),
                data['survived'], test_size=0.3, random_state=0)

X_train[['cabin', 'pclass', 'embarked']].head(10)

     cabin pclass embarked
501      n      2        S
588      n      2        S
402      n      2        C
1193     n      3        Q
686      n      3        Q
971      n      3        Q
117      E      1        C
540      n      2        S
294      C      1        C
261      E      1        S

In [127]:
# set up the encoder
encoder = ce.DecisionTreeCategoricalEncoder(variables=['cabin', 'pclass', 'embarked'],
          random_state=0) # we can pass many other parameters. Below is the class definition. 

#class
#feature_engine.categorical_encoders.DecisionTreeCategoricalEncoder(encoding_method='arbitrary', 
#cv=3, scoring='neg_mean_squared_error', param_grid={'max_depth': [1, 2, 3, 4]}, 
#regression=True, random_state=None, variables=None)


# fit the encoder
encoder.fit(X_train, y_train)

# transform the data
train_t = encoder.transform(X_train)
test_t = encoder.transform(X_test)

train_t[['cabin', 'pclass', 'embarked']].head(10)

         cabin    pclass  embarked
501   0.304843  0.436170  0.338957
588   0.304843  0.436170  0.338957
402   0.304843  0.436170  0.558011
1193  0.304843  0.259036  0.373494
686   0.304843  0.259036  0.373494
971   0.304843  0.259036  0.373494
117   0.649533  0.617391  0.558011
540   0.304843  0.436170  0.338957
294   0.649533  0.617391  0.558011
261   0.649533  0.617391  0.338957